In [1]:
import psycopg2
from psycopg2  import extras
from sqlalchemy import create_engine
from sqlalchemy.orm import scoped_session, sessionmaker
from sqlalchemy import Table, Column, Integer, String, MetaData, ForeignKey

DATABASE = 'postgresql'
USER = 'root'
PASSWORD = 'root'
HOST = 'postgres' # shared-networkに所属しているpostgres containerを指定できる
PORT = '5432'
DB_NAME = 'sandbox'

CONNECT_STR = '{}://{}:{}@{}:{}/{}'.format(DATABASE, USER, PASSWORD, HOST, PORT, DB_NAME)
engine = create_engine(CONNECT_STR)

conn = engine.connect()
res = conn.execute("select datname, datdba, encoding, datcollate, datctype from pg_database;")

for row in res:
    print(row)

('postgres', 10, 6, 'ja_JP.UTF-8', 'ja_JP.UTF-8')
('sandbox', 10, 6, 'ja_JP.UTF-8', 'ja_JP.UTF-8')
('template1', 10, 6, 'ja_JP.UTF-8', 'ja_JP.UTF-8')
('template0', 10, 6, 'ja_JP.UTF-8', 'ja_JP.UTF-8')

In [2]:
# create poptbl
tablename_a = 'x004_course_master'
a_q1 = "SELECT * FROM information_schema.tables WHERE table_name = '{}';".format(tablename_a)
a_res = conn.execute(a_q1)

a_q2 = """
CREATE TABLE  {} (
    course_id integer NOT NULL,
    course_name  varchar(256) NOT NULL
);
""".format(tablename_a)

tablename_b = 'x004_open_course'
b_q1 = "SELECT * FROM information_schema.tables WHERE table_name = '{}';".format(tablename_b)
b_res = conn.execute(b_q1)

b_q2 = """
CREATE TABLE  {} (
    monthx varchar(256) NOT NULL,
    course_id  integer NOT NULL
);
""".format(tablename_b)

if sum(1 for _ in a_res) == 0:
    print("create")
    conn.execute(a_q2)
    res = conn.execute(a_q1)
    sum(1 for _ in res)

if sum(1 for _ in b_res) == 0:
    print("create")
    conn.execute(b_q2)
    res = conn.execute(b_q1)
    sum(1 for _ in res)

In [3]:
# insert data
data = (
    (1, '経理入門'),
    (2, '財務知識'),
    (3, '簿記検定開講講座'),
    (4, '税理士')
)

conn.execute("DELETE FROM {};".format(tablename_a))

metadata = MetaData()
tbl = Table(tablename_a, metadata,
            Column('course_id', Integer, primary_key=False),
            Column('course_name', String),
           )

for i in data:
    ins = tbl.insert().values(course_id=i[0], course_name=i[1])
    conn.execute(ins)

res = conn.execute("SELECT * FROM {};".format(tablename_a))
for i in res:
    print(i)

data = (
    ('201806', 1),
    ('201806', 3),
    ('201806', 4),
    ('201807', 4),
    ('201808', 2),
    ('201808', 4)
)

conn.execute("DELETE FROM {};".format(tablename_b))

metadata = MetaData()
tbl = Table(tablename_b, metadata,
            Column('monthx', String, primary_key=False),
            Column('course_id', Integer),
           )

for i in data:
    ins = tbl.insert().values(monthx=i[0], course_id=i[1])
    conn.execute(ins)

res = conn.execute("SELECT * FROM {};".format(tablename_b))
for i in res:
    print(i)

(1, '経理入門')
(2, '財務知識')
(3, '簿記検定開講講座')
(4, '税理士')
('201806', 1)
('201806', 3)
('201806', 4)
('201807', 4)
('201808', 2)
('201808', 4)

期待する結果

|course_name|6月|7月|8月|
|:--|:--|:--|:--|
|経理入門|○|×|×|
|財務知識|×|×|○|
|簿記検定開講講座|○|×|×|
|税理士|○|○|○|

In [4]:
q = f"""
select course_name,
    case when course_id in
        (select course_id from {tablename_b} where monthx = '201806') then '○'
        else '×' end as "6月",
    case when course_id in
        (select course_id from {tablename_b} where monthx = '201807') then '○'
        else '×' end as "7月",
    case when course_id in
        (select course_id from {tablename_b} where monthx = '201808') then '○'
        else '×' end as "8月"
    from {tablename_a};
"""

print(q)

res = conn.execute(q)
for i in res:
    print(i)

select course_name,
    case when course_id in
        (select course_id from x004_open_course where monthx = '201806') then '○'
        else '×' end as "6月",
    case when course_id in
        (select course_id from x004_open_course where monthx = '201807') then '○'
        else '×' end as "7月",
    case when course_id in
        (select course_id from x004_open_course where monthx = '201808') then '○'
        else '×' end as "8月"
    from x004_course_master;

('経理入門', '○', '×', '×')
('財務知識', '×', '×', '○')
('簿記検定開講講座', '○', '×', '×')
('税理士', '○', '○', '○')